## Pandas Library

In [1]:
import pandas as pd

In [5]:
# Series
#Using 1-D list (default indexes 0,1,2,3...) and (values -> collection el)
data = [5,6,7,8,9,10]
series = pd.Series(data)
print(series)
print(type(series))

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64
<class 'pandas.Series'>

In [6]:
#Series using dictionary
dic = {'a':1,'b':2,'c':3}  
series_dict = pd.Series(dic)  #(key->indexes) and (values->series value)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.Series'>

In [7]:
#Creating Series with Our indexes

lst = [10,11,12,13,14]
indx = ['a','b','c','d','e']
print(pd.Series(lst,index=indx))

a    10
b    11
c    12
d    13
e    14
dtype: int64

In [18]:
## Dataframe in pandas(2-D dimensional)-Data like in excel or csv sheet

## Creating DataFrame from Dictionary

dic = {
    'Name':['Sumit','Shubham','Amit','Suryansh'],
    'Age':[20,21,24,22],
    'City':['Kanpur','Kanpur','Kanpur','Roora'],
    'Grade':['A','B+','A+','B'],
}

df = pd.DataFrame(dic)
print(df)
print(type(df))

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B
<class 'pandas.DataFrame'>

In [11]:
import numpy as np

print(np.array(df))

[['Sumit' 20 'Kanpur' 'A']
 ['Shubham' 21 'Kanpur' 'B+']
 ['Amit' 24 'Kanpur' 'A+']
 ['Suryansh' 22 'Roora' 'B']]

In [14]:
# Using List of dictionary

lst = [
    {'Name':'Sumit','Age':20,'City':'Kanpur','Grade':'A'},
    {'Name':'Shubham','Age':22,'City':'Kanpur','Grade':'B'},
    {'Name':'Suryansh','Age':23,'City':'Kanpur','Grade':'B+'},
    {'Name':'Amit','Age':24,'City':'Kanpur','Grade':'A+'},
]

df = pd.DataFrame(lst)
print(df)

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   22  Kanpur     B
2  Suryansh   23  Kanpur    B+
3      Amit   24  Kanpur    A+

In [15]:
df = pd.read_csv('sales_data.csv')
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
# To print first n rows of data
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [17]:
# To print last n rows of data
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
#How to access data from dataframe
df

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B

In [20]:
# To acces a particular column data
print(df['Name'])

0       Sumit
1     Shubham
2        Amit
3    Suryansh
Name: Name, dtype: str

In [43]:
# To acces a row using index
print(df.loc[0]) # location

Name      Sumit
Age          20
City     Kanpur
Grade         A
Name: 0, dtype: object

In [41]:
print(df.iloc[0]) # Index location
print(df.iloc[0,0])
print(df.iloc[0,1])

Name      Sumit
Age          20
City     Kanpur
Grade         A
Name: 0, dtype: object
Sumit
20

In [36]:
df

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B

In [ ]:
# Accessing specified element using at - (row index , column)->value
print(df.at[1,'Age'])
print(df.at[0,'Age'])
print(df.at[0,'Name'])
print(df.at[1,'Name'])

21
20
Sumit
Shubham

In [35]:
df

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B

In [39]:
## Accessing specified element using iat - (row index,column index)->val
print(df.iat[0,0])
print(df.iat[0,1])
print(df.iat[0,2])
print(df.iat[0,3])

Sumit
20
Kanpur
A

In [44]:
# Data Manipulation in dataframe

df

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B

In [45]:
# Add a new column

df['Salary'] = [5000,2000,3000,10000]
df

       Name  Age    City Grade  Salary
0     Sumit   20  Kanpur     A    5000
1   Shubham   21  Kanpur    B+    2000
2      Amit   24  Kanpur    A+    3000
3  Suryansh   22   Roora     B   10000

In [ ]:
# To delete a colum - drop()

df.drop('Salary',axis=0) # axis by default checks in row index for column , so you have to make it 1 for column check

KeyError: "['Salary'] not found in axis"

In [49]:
df.drop('Salary',axis=1)

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B

In [ ]:
df # Again salary comes because by default .drop() do a temporary operation not permanet to make it permanent use inplace = True

       Name  Age    City Grade  Salary
0     Sumit   20  Kanpur     A    5000
1   Shubham   21  Kanpur    B+    2000
2      Amit   24  Kanpur    A+    3000
3  Suryansh   22   Roora     B   10000

In [51]:
df.drop('Salary',axis=1,inplace=True)

In [52]:
df

       Name  Age    City Grade
0     Sumit   20  Kanpur     A
1   Shubham   21  Kanpur    B+
2      Amit   24  Kanpur    A+
3  Suryansh   22   Roora     B

In [53]:
# To add or sub in column

df['Age'] = df['Age']+1
df

       Name  Age    City Grade
0     Sumit   21  Kanpur     A
1   Shubham   22  Kanpur    B+
2      Amit   25  Kanpur    A+
3  Suryansh   23   Roora     B

In [54]:
 # To remove using row index

 df.drop(0,inplace=True)

In [55]:
df

       Name  Age    City Grade
1   Shubham   22  Kanpur    B+
2      Amit   25  Kanpur    A+
3  Suryansh   23   Roora     B

In [56]:
df = pd.read_csv('sales_data.csv')

In [ ]:
df.dtypes # Returns the series of(colum , datatype)

Transaction ID        int64
Date                    str
Product Category        str
Product Name            str
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region                  str
Payment Method          str
dtype: object

In [59]:
df.describe() # Returns the statistical summary of dataframe

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000